import React from "react";
import Faq from "react-faq-component";

const data = {
  title: "Найпоширеніші питання",
  rows: [
    {
      title: "Що таке альтернативна енергія?",
      content: `Альтернативна енергія - це джерела енергії, які не ґрунтуються на використанні традиційних джерел, 
            таких як нафта, вугілля і газ. \n Включає сонячну, вітрову, гідроелектроенергію, біомасу та інші.`,
    },
    {
      title: "Чому варто використовувати альтернативну енергію?",
      content:
        "Використання альтернативної енергії допомагає знизити забруднення навколишнього середовища, зменшити залежність від обмежених ресурсів і заощадити гроші в довгостроковій перспективі.",
    },
    {
      title: "Які переваги сонячної енергії?",
      content:
        `Сонячна енергія чиста, доступна всюди, нескінченна і безкоштовна після встановлення сонячних панелей. \n` +
        `Вона також допомагає зменшити рахунки за електроенергію і може бути використана в віддалених місцях, де немає доступу до мережі електропостачання.`,
    },
    {
      title: "Які гарантії та сертифікації ідуть з вашою продукцією?",
      content:
        "Ми надаємо гарантії на нашу продукцію на протязі 3 років. \n " +
        "Багато з наших продуктів також мають сертифікацію, що підтверджує їх якість та безпеку.",
    },
    {
      title:
        "Як я можу підтримувати та обслуговувати свою альтернативну енергетичну систему?",
      content:
        "Регулярне технічне обслуговування важливе для забезпечення довговічності та ефективності вашої системи. \n " +
        "Ми пропонуємо програми обслуговування та рекомендації щодо догляду, щоб ваша система працювала без збоїв.",
    },
  ],
};

const config = {
  animate: true,
  expandIcon: "+",
  collapseIcon: "-",
};

const styles = {
  arrowColor: "var(--textHover)",
  transitionDuration: "1s",
  timingFunc: "ease",
  bgColor: "var(--background)",
  titleTextColor: "var(--borderHover)",
  titleTextSize: "32px",
  rowTitleColor: "var(--textHover)",
  rowContentColor: "white",
  rowContentPaddingTop: "2vh",
  rowContentPaddingBottom: "2vh",
  rowContentTextSize: "18px",
};

const FaqComponent = () => {
  return (
    <section className={"wrapFaq"}>
      <Faq styles={styles} data={data} config={config} />
    </section>
  );
};

export default FaqComponent;
