import React from "react";
import classes from "./WarrantlyComponent.module.css";
import { motion } from "framer-motion";

const WarrantyBlock = () => {
  return (
    <main className={classes.warrantyWrapper}>
      <h1>Гарантія та сервіс</h1>

      <motion.img
        initial={{ opacity: 0, y: -20, scale: 0.9 }}
        transition={{ duration: 2 }}
        whileInView={{ opacity: 1, y: 0, scale: 1 }}
        className={classes.warrantyPhoto}
        loading="lazy"
        src="/warranty.webp"
        alt="SolarPanels"
      />
      <div className={classes.warrantyText}>
        <p>
          Прийнявши рішення про вибір продукції в інтернет-магазині Energy
          Solar, ви отримуєте найвищу якість та надійність у сфері
          альтернативної енергетики. Наші продукти проходять високі стандарти
          якості та надійності, щоб забезпечити вам ефективну та стабільну
          роботу вашої системи живлення.
        </p>
        <p>
          Ми розуміємо, що навіть ідеально спроектовані пристрої можуть виявити
          несправності у роботі через різноманітні причини. Тому в сервісному
          центрі Energy Solar працюють кваліфіковані фахівці з багаторічним
          досвідом у галузі альтернативної енергетики. Вони гарантують найкраще
          обслуговування в Україні як під час гарантійного, так і
          післягарантійного періодів.
        </p>
        <p>
          Купуючи продукцію у мережі магазинів Energy Solar, ви користуєтесь
          всіма правами, передбаченими Законом України "Про захист прав
          споживачів". Проте важливо зауважити, що гарантійні зобов'язання
          можуть бути обмежені у випадках:
        </p>
        <ul>
          <li>Використання продукції не за призначенням;</li>
          <li>
            Недбала експлуатація, транспортування або порушення правил
            користування;
          </li>
          <li>
            Вплив зовнішніх факторів, таких як висока або низька температура,
            електромагнітне випромінювання, вологість та інші;
          </li>
          <li>Механічні пошкодження;</li>
          <li>Незаконне тестування або ремонт;</li>
          <li>
            Випадки, пов'язані з недостатньою роботою мережі, умовами ландшафту
            або забудовою.
          </li>
        </ul>
        <p>
          Дотримання вищезазначених умов є важливим для можливості гарантійного
          ремонту. Остаточне рішення про можливість гарантійного обслуговування
          приймається після діагностики продукції в сервісному центрі Energy
          Solar.
        </p>
      </div>

      <motion.img
        initial={{ opacity: 0, y: -20, scale: 0.9 }}
        transition={{ duration: 2 }}
        whileInView={{ opacity: 1, y: 0, scale: 1 }}
        className={classes.warrantyPhoto}
        loading="lazy"
        src="/warranty1.webp"
        alt="SolarPanels"
      />

      <div className={classes.warrantyText}>
        <h1>Обмін та повернення товару</h1>
        <p>
          Згідно із «Законом про захист прав споживача», у вас є можливість
          обміняти або повернути товар протягом 14 днів з моменту покупки.
        </p>
        <p>Перш ніж скористатися цією можливістю, переконайтеся, що:</p>
        <ul>
          <li>
            Товар не був у вживанні та не має слідів використання: подряпин,
            сколів, потертостей, програмне забезпечення не піддавалося змінам та
            іншого;
          </li>
          <li>
            Товар повністю укомплектований і не порушена цілісність упаковки;
          </li>
          <li>Збережені всі ярлики і заводське маркування.</li>
        </ul>
        <p>
          Це означає, що у вас є право обміняти непродовольчий товар належної
          якості на аналогічний, якщо він не відповідає вашим очікуванням за
          формою, габаритами, фасоном, кольором, розміром або з інших причин не
          може бути вами використаний за призначенням. Обмін товару належної
          якості можливий лише у випадку, якщо він не був вжитий, а також якщо
          збережено його товарний вигляд, споживчі властивості, пломби, ярлики,
          а також розрахунковий документ.
        </p>
        <p>
          У разі, якщо товар не працює, обмін або повернення товару можливі лише
          за наявності висновку/акту сервісного центру щодо того, що умови
          експлуатації не порушені.
        </p>
        <p>
          Для обміну або повернення товару відвідайте магазин нашої мережі
          Energy Solar, де ви здійснили покупку. Будь ласка, майте при собі
          товар, упаковку та всі комплектуючі, а також гарантійний талон і
          товарний чек.
        </p>
        <p>
          Отримати додаткову інформацію щодо повернення товару та гарантійного
          обслуговування можна за телефоном гарячої лінії: +38 000 000 00 00
          (щодня з 9:00 до 22:00, дзвінки по території України зі стаціонарних
          та мобільних телефонів безкоштовні). Умови обміну або повернення
          товару вказані вище.
        </p>
      </div>

      <motion.img
        initial={{ opacity: 0, y: -20, scale: 0.9 }} // начальное состояние
        transition={{ duration: 2 }} // продолжительность анимации
        whileInView={{ opacity: 1, y: 0, scale: 1 }}
        className={classes.warrantyPhoto}
        loading="lazy"
        src="/warranty2.webp"
        alt="SolarPanels"
      />

      <div className={classes.warrantyText}>
        <h1>Гарантійне обслуговування</h1>
        <p>
          У разі потреби у гарантійному обслуговуванні товару, ми просимо вас
          звернутися:
        </p>
        <ul>
          <li>В магазин, де ви придбали цей пристрій;</li>
          <li>
            За телефоном гарячої лінії за номером +38 000 000 00 00 (щодня з
            9:00 до 22:00, дзвінки безкоштовні по території України зі
            стаціонарних та мобільних телефонів)
          </li>
        </ul>
        <p>
          Наші спеціалісти будуть раді допомогти вам у вирішенні будь-яких
          питань щодо гарантійного обслуговування вашого обладнання.
        </p>
      </div>
      <div className={classes.warrantyText}>
        <h1>Умови гарантійного обслуговування</h1>
        <div>
          <p>Термін гарантії:</p>
          <ul>
            <li>
              Гарантія надається на всі сонячні панелі та обладнання для
              альтернативної енергетики на період 3 роки з моменту придбання.
            </li>
          </ul>
          <p>Покриття гарантії:</p>
          <ul>
            <li>
              Гарантія охоплює будь-які дефекти в матеріалах та виробництві, а
              також втрату продуктивності панелей до певного рівня відповідно до
              встановлених стандартів.
            </li>
          </ul>
          <p>Виключення:</p>
          <ul>
            <li>
              Гарантія не покриває будь-які пошкодження, спричинені неправильною
              експлуатацією, природними катастрофами або втратами, що виникли
              внаслідок втручання користувача у внутрішню структуру продукту.
            </li>
          </ul>
          <p>Процедура звернення:</p>
          <ul>
            <li>
              У разі виявлення дефектів або проблем з продукцією, клієнт має
              звертатися до магазину Energy Solar за адресою [вказати адресу]
              або за телефоном [вказати номер телефону]. Для здійснення
              гарантійного обслуговування необхідно пред'явити доказ покупки та
              інші відповідні документи.
            </li>
          </ul>
          <p>Відповідальність:</p>
          <ul>
            <li>
              Магазин Energy Solar зобов'язується надати якісне та професійне
              гарантійне обслуговування відповідно до встановлених стандартів.
              Клієнт, у свою чергу, зобов'язаний дотримуватися інструкцій з
              експлуатації та технічного обслуговування продукції.
            </li>
          </ul>
          <p>Умови виконання гарантії:</p>
          <ul>
            <li>
              Клієнт повинен забезпечити правильне та регулярне технічне
              обслуговування системи відповідно до рекомендацій виробника.
              Будь-яке порушення цих умов може призвести до втрати гарантійного
              покриття.
            </li>
          </ul>
          <p>Повернення та обмін:</p>
          <ul>
            <li>
              У випадку виявлення серйозних дефектів, які не можуть бути
              виправлені, клієнт має право на обмін або повернення продукту
              протягом терміну гарантії.
            </li>
          </ul>
          <p>
            Ці умови гарантійного обслуговування є чинними для всіх покупок в
            магазині Energy Solar і регулюють права та обов'язки як магазину,
            так і клієнтів.
          </p>
        </div>
      </div>
    </main>
  );
};

export default WarrantyBlock;
